Revit 2027 API
ParameterTypeId.EnergyAnalysisWindowTypeJson Property
 "JSON data for Window Types"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId EnergyAnalysisWindowTypeJson { get; }
Public Shared ReadOnly Property EnergyAnalysisWindowTypeJson As ForgeTypeId
	Get
public:
static property ForgeTypeId^ EnergyAnalysisWindowTypeJson {
	ForgeTypeId^ get ();
}
static member EnergyAnalysisWindowTypeJson : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace